In [4]:
import pandas as pd
import psycopg2
import os
from os import path, listdir
from os.path import join

In [8]:
# show the list of all the data in the folder
path = "../Data Engineer/data"
listdir(path)

['friends_table.csv',
 'posts_table.csv',
 'reactions_table.csv',
 'user_table.csv']

In [13]:
def open_data(name,directory=path):
    data = os.path.join(directory,name)
    return pd.read_csv(data)

In [15]:
friends_df = open_data('friends_table.csv')
friends_df.head()

   Friend 1  Friend 2
0         1       555
1         1       921
2         1       213
3         1       184
4         1       242

In [44]:
friends_df["Friend 1"].max()

1000

In [16]:
posts_df = open_data('posts_table.csv')
posts_df.head()

   User      Post Type   Post Date
0     1          Image  1588166977
1     1  Status_Change  1588167686
2     1           Text  1588168633
3     1          Image  1588163570
4     1          Image  1588168986

In [45]:
posts_df.User.describe()

count    13158.000000
mean       504.566347
std        289.159974
min          1.000000
25%        257.000000
50%        500.000000
75%        757.000000
max       1000.000000
Name: User, dtype: float64

In [17]:
reactions_df = open_data('reactions_table.csv')
reactions_df.head()

   User Reaction Type  Reaction Date
0  3741       Comment     1588168107
1   711      Emoticon     1588166846
2   701      Emoticon     1588163334
3  4750      Emoticon     1588168182
4   656       Comment     1588162272

In [19]:
users_df = open_data('user_table.csv')
users_df.head()

    Surname      Name  Age  Subscription Date
0     Smith     Sarah   30         1588157373
1    Picard  Francine   32         1588161732
2      Roth      Hans   40         1588157337
3     Pomme       Ali   28         1588165636
4  Di Lillo     Jordi   42         1588156042

In [84]:
def add_UserID(file):
    user_id = list(range(1,(len(users_df)+1)))
    file.User = user_id
    return file
    
users_df.apply(add_UserID)

         Surname      Name  Age  Subscription Date  User
0          Smith     Sarah   30         1588157373     1
1         Picard  Francine   32         1588161732     2
2           Roth      Hans   40         1588157337     3
3          Pomme       Ali   28         1588165636     4
4       Di Lillo     Jordi   42         1588156042     5
..           ...       ...  ...                ...   ...
995         Kirk       Lee   19         1588160246   996
996        Pomme     Franz   40         1588159625   997
997       Gwahsi    Thomas   40         1588165504   998
998  Beierlorzer  Jean-Luc   32         1588151074   999
999     Thronton     Franz   28         1588171183  1000

[1000 rows x 5 columns]

## Database Connection

Create a connection to the database

In [87]:
try:
    conn = psycopg2.connect("host=localhost dbname=postgres user=postgres password = 1118")
except psycopg2.Error as e:
    print("Error: Could not make a connection to the Postgres database")
    print(e)

### Use the connection to get a cursor that can be used ti excecute the queries

In [88]:
try:
    cur = conn.cursor()
except psycopg2.Error as e:
    print("Error: Could not get cursor ro the Database")
    print(e)

### Set automatic comiit to Ture, so that each command is executed instantly

In [89]:
conn.set_session(autocommit = True)

### Create a Database to work in

In [91]:
try:
    cur.execute("CREATE DATABASE socialmediadb")
except psycopg2.Error as e:
        print(e)

In [94]:
# close the postgres database
try:
    conn.close()
except psycopg2.Error as e:
    print(e)
     
    
#connect new database

try:
    conn = psycopg2.connect("host=localhost dbname=socialmediadb user=postgres password=1118")
except psycopg2.Error as e:
    print("Error: could not make connection to the database")
    print(e)
    
#insert cursor into your database

try:
    cur = conn.cursor()
except psycopg2.Error as e:
    print("Error: could not insert cursor into the database")
    print(e)
    
    
# set auto commit
conn.set_session(autocommit=True)

### Create table for each of the dataframe

In [95]:
users_df.columns

Index(['Surname', 'Name', 'Age', 'Subscription Date', 'User'], dtype='object')

In [102]:
try:
    cur.execute("CREATE TABLE IF NOT EXISTS users (User int, Surname varchar, Name varchar,\
    Age int, Subscription_date date);")

except psycopg2.Error as e:
    print("Error: Issue creating table")
    print(e)

Error: Issue creating table
syntax error at or near "User"
LINE 1: CREATE TABLE IF NOT EXISTS users (User int, Surname varchar,...
                                          ^